Revit 2024 API
AssetPropertyDoubleArray4d Class
 Represents a color property of material.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class AssetPropertyDoubleArray4d : AssetProperty
Visual Basic
Public Class AssetPropertyDoubleArray4d _
	Inherits AssetProperty
Visual C++
public ref class AssetPropertyDoubleArray4d : public AssetProperty
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.AssetProperty
 Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray4d
See Also
AssetPropertyDoubleArray4d Members
Autodesk.Revit.DB.Visual Namespace